// *********************************************************************************************************************
// Tianchi C++ library for Qt (open source)
// 天池共享源码库
// 版权所有 (C) 天池共享源码库开发组
// 授权协议：请阅读天池共享源码库附带的授权协议
// *********************************************************************************************************************
// 文档说明：窗体内容扩展
// =====================================================================================================================
// 开发日志：
// 日期         人员        说明
// ---------------------------------------------------------------------------------------------------------------------
// 2012.08.23   roywillow   原创
// 2013.04.22   XChinux     修改
//
// =====================================================================================================================
/// @file TcFormUtils.h 窗体内容扩展

#ifndef TIANCHI_FORMUTILS_H
#define TIANCHI_FORMUTILS_H

#include "TcGlobal.h"

#include <QWidget>

class TIANCHI_API TcFormUtils
{
public:
    TcFormUtils();

    inline QWidget* parentForm() const { return m_parentForm; }
    inline void     setParentForm(QWidget* value) { m_parentForm = value; }
private:
    QWidget*    m_parentForm;
};

#endif // TIANCHI_FORMUTILS_H
