// ********************************************************************************************************************
// Tianchi C++ library for Qt (open source)
// 天池共享源码库
// 版权所有 (C) 天池共享源码库开发组
// 授权协议：请阅读天池共享源码库附带的授权协议
// ********************************************************************************************************************
// 文档说明：天池标准定义集
// ====================================================================================================================
// 开发日志：
// 日期         人员        说明
// --------------------------------------------------------------------------------------------------------------------
// 2013.04.11   cnhemiya    建立
// 2013.04.17   XChinux     参照Qt/qglobal.h文件重写Global.h
// ====================================================================================================================
// 使用说明:
// 1. 编译生成 tianchi.dll 时请在 .pro 中添加：
//     DEFINES += TIANCHI_EXPORT
// ====================================================================================================================
/// @file Global.h 天池标准定义集
#ifndef TIANCHI_GLOBAL_H
#define TIANCHI_GLOBAL_H

#include <QtGlobal>

/// @brief 《天池共享源码库》的发布版本号
#define TIANCHI_VERSION 0x000001

/// @brief 类前缀的描述字
#if defined(TIANCHI_EXPORT)
#   define TIANCHI_API Q_DECL_EXPORT
#elif defined(TIANCHI_IMPORT)
#   define TIANCHI_API Q_DECL_IMPORT
#else
#   define TIANCHI_API
#endif

#endif // TIANCHI_GLOBAL_H
